# Create Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
GlobalParameter..::..Create Method
GlobalParameter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String, ForgeTypeId) | Creates a new Global Parameter in the given document. |
| Create(Document, String, ParameterType) | **Obsolete.** Creates a new Global Parameter in the given document. |

# See Also
GlobalParameter Class
GlobalParameter Members
Autodesk.Revit.DB Namespace